#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------

//  написать программу, которая заполняет массив размерности nxn по заданному правилу :
/*    1  3  4 10 11
	  2  5  9 12 19
	  6  8 13 18 20
	  7 14 17 21 24
	 15 16 22 23 25  */
// То есть, заполнение массива должно быть по диагонали, сверху - вниз, слева - направо.
// Причем заполнение еще и зигзагообразное.


//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");
	srand(time(NULL));
	//-------------------------------САМА ПРОГА-------------------------------------

	int n, x = 1;

	cout << "Введите размер стороны массива: ";
	cin >> n;

	int** arr = new int* [n];           // строки

	for (int i = 0; i < n; i++)        // строки
	{
		arr[i] = new int[n];           // столбцы
	}

	//-------ЛОГИКА-------------------------------------------

	int s = 0, k = 0, f = 1;
	

	
	
	arr[s][k] = x;

	while (f != n)
	{

		s += 1;
		            x += 1;
        arr[s][k] = x;


		for (int i = 0; i < f; i++)
		{
			s -= 1;
			k += 1;

			        x += 1;
		arr[s][k] = x;
		}
        f += 1;
		
		
		if (f == n)
		{
			break;
		}

		//---------------

		k += 1;
		            x += 1;
        arr[s][k] = x;


		for (int i = 0; i < f; i++)
		{
			s += 1;
			k -= 1;

		        	x += 1;
		arr[s][k] = x;
		}
		f += 1;
	

	}

	//-------ВЫВОД--------------------------------------------
	/*
	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << arr[i][j] << "  ";
		}
		cout << endl;
	}
	cout << endl << endl;
	*/
	//----------------------- ОБРАТКА ---------------------------
	f = n - 2;

	if (n % 2 == 1)
	{

		while (x != n * n)
		{
			k += 1;
			x += 1;
			arr[s][k] = x;
		

			for (int i = 0; i < f; i++)
			{
				s -= 1;
				k += 1;

				x += 1;
				arr[s][k] = x;
			}
			f -= 1;

			//---------------

			s += 1;
			x += 1;
			arr[s][k] = x;
			if (x == n * n)
			{
				break;
			}


			for (int i = 0; i < f; i++)
			{
				s += 1;
				k -= 1;

				x += 1;
				arr[s][k] = x;
			}
			f -= 1;


		}
	}

	else
	{
		while (x != n * n)
		{
			s += 1;
			x += 1;
			arr[s][k] = x;
			if (x == n * n)
			{
				break;
			}

			for (int i = 0; i < f; i++)
			{
				s += 1;
				k -= 1;

				x += 1;
				arr[s][k] = x;
			}
			f -= 1;

			//---------------

			k += 1;
			x += 1;
			arr[s][k] = x;


			for (int i = 0; i < f; i++)
			{
				s -= 1;
				k += 1;

				x += 1;
				arr[s][k] = x;
			}
			f -= 1;


		}





	}


	//-------ЛОГИКА конец ------------------------------------

	//-------ВЫВОД--------------------------------------------

	for (int i = 0; i < n; i++)
	{
		for (int j = 0; j < n; j++)
		{
			cout << arr[i][j] << "\t";
		}
		cout << endl << endl;
	}
	cout << endl << endl;


	//-------УДАЛЕНИЕ-----------------------------------------

	for (int i = 0;i < n; i++)
	{
		delete[]arr[i];
	}
	delete[]arr;

	system("pause");

	return 0;
}
